docs/performance-tests/load-test-results/basic-20251018-021959/raw/12_read_search_nm.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 800 requests
Completed 1600 requests
Completed 2400 requests
Completed 3200 requests
Completed 4000 requests
Completed 4800 requests
Completed 5600 requests
Completed 6400 requests
Completed 7200 requests
Completed 8000 requests
Finished 8000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/items/search?name=laptop
Document Length:        1120 bytes

Concurrency Level:      100
Time taken for tests:   1.428 seconds
Complete requests:      8000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      9800000 bytes
HTML transferred:       8960000 bytes
Requests per second:    5600.86 [#/sec] (mean)
Time per request:       17.854 [ms] (mean)
Time per request:       0.179 [ms] (mean, across all concurrent requests)
Transfer rate:          6700.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       6
Processing:     2   18  10.1     16     128
Waiting:        1   17   9.8     15     128
Total:          2   18  10.1     16     128

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     16
  75%     17
  80%     17
  90%     19
  95%     27
  98%     42
  99%     90
 100%    128 (longest request)