docs/performance-tests/load-test-results/basic-20251018-021959/raw/14_read_search_pr.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 800 requests
Completed 1600 requests
Completed 2400 requests
Completed 3200 requests
Completed 4000 requests
Completed 4800 requests
Completed 5600 requests
Completed 6400 requests
Completed 7200 requests
Completed 8000 requests
Finished 8000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/items/search/price?minPrice=500&maxPrice=2000
Document Length:        2872 bytes

Concurrency Level:      100
Time taken for tests:   1.307 seconds
Complete requests:      8000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      23816000 bytes
HTML transferred:       22976000 bytes
Requests per second:    6119.24 [#/sec] (mean)
Time per request:       16.342 [ms] (mean)
Time per request:       0.163 [ms] (mean, across all concurrent requests)
Transfer rate:          17790.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     2   16   2.1     16      34
Waiting:        1   16   2.1     16      33
Total:          2   16   2.1     16      34

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     17
  75%     17
  80%     17
  90%     18
  95%     19
  98%     22
  99%     24
 100%     34 (longest request)