docs/performance-tests/load-test-results/basic-20251018-021959/raw/23_write_addspecs.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 200 requests
Completed 400 requests
Completed 600 requests
Completed 800 requests
Completed 1000 requests
Completed 1200 requests
Completed 1400 requests
Completed 1600 requests
Completed 1800 requests
Completed 2000 requests
Finished 2000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/items/d8f87bf0-e682-4229-b21c-66c3804f2582/specifications
Document Length:        474 bytes

Concurrency Level:      50
Time taken for tests:   0.464 seconds
Complete requests:      2000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      1158000 bytes
Total body sent:        628000
HTML transferred:       948000 bytes
Requests per second:    4311.95 [#/sec] (mean)
Time per request:       11.596 [ms] (mean)
Time per request:       0.232 [ms] (mean, across all concurrent requests)
Transfer rate:          2438.11 [Kbytes/sec] received
                        1322.22 kb/s sent
                        3760.33 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     7   11   1.9     11      22
Waiting:        6   11   1.9     10      21
Total:          7   11   1.9     11      22

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     12
  80%     12
  90%     14
  95%     15
  98%     16
  99%     17
 100%     22 (longest request)